sophgo/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Source/GCC/svd/HC32F4A0.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="CMP1">
            <name>CMP3</name>
            <description>desc CMP</description>
            <baseAddress>0x4004A400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xA</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="CMP2">
            <name>CMP4</name>
            <description>desc CMP</description>
            <baseAddress>0x4004A410</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xA</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>CMU</name>
            <description>desc CMU</description>
            <baseAddress>0x4004C400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x7D08</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>XTAL32CR</name>
                    <description>desc XTAL32CR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>XTAL32STP</name>
                            <description>desc XTAL32STP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XTAL32CFGR</name>
                    <description>desc XTAL32CFGR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>XTAL32DRV</name>
                            <description>desc XTAL32DRV</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTAL32IE</name>
                            <description>desc XTAL32IE</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XTAL32NFR</name>
                    <description>desc XTAL32NFR</description>
                    <addressOffset>0x14</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>XTAL32NF</name>
                            <description>desc XTAL32NF</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LRCCR</name>
                    <description>desc LRCCR</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>LRCSTP</name>
                            <description>desc LRCSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LRCTRM</name>
                    <description>desc LRCTRM</description>
                    <addressOffset>0x24</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>RTCLRCTRM</name>
                    <description>desc RTCLRCTRM</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>XTALCFGR</name>
                    <description>desc XTALCFGR</description>
                    <addressOffset>0x878</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0x70</resetMask>
                    <fields>
                        <field>
                            <name>XTALDRV</name>
                            <description>desc XTALDRV</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALMS</name>
                            <description>desc XTALMS</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PERICKSEL</name>
                    <description>desc PERICKSEL</description>
                    <addressOffset>0x7C10</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>PERICKSEL</name>
                            <description>desc PERICKSEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2SCKSEL</name>
                    <description>desc I2SCKSEL</description>
                    <addressOffset>0x7C12</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xBBBB</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>I2S1CKSEL</name>
                            <description>desc I2S1CKSEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2S2CKSEL</name>
                            <description>desc I2S2CKSEL</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2S3CKSEL</name>
                            <description>desc I2S3CKSEL</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2S4CKSEL</name>
                            <description>desc I2S4CKSEL</description>
                            <msb>15</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CANCKCFGR</name>
                    <description>desc CANCKCFGR</description>
                    <addressOffset>0x7C18</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xDD</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CAN1CKS</name>
                            <description>desc CAN1CKS</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN2CKS</name>
                            <description>desc CAN2CKS</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCFGR</name>
                    <description>desc SCFGR</description>
                    <addressOffset>0x7C20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7777777</resetMask>
                    <fields>
                        <field>
                            <name>PCLK0S</name>
                            <description>desc PCLK0S</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCLK1S</name>
                            <description>desc PCLK1S</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCLK2S</name>
                            <description>desc PCLK2S</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCLK3S</name>
                            <description>desc PCLK3S</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCLK4S</name>
                            <description>desc PCLK4S</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXCKS</name>
                            <description>desc EXCKS</description>
                            <msb>22</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLKS</name>
                            <description>desc HCLKS</description>
                            <msb>26</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USBCKCFGR</name>
                    <description>desc USBCKCFGR</description>
                    <addressOffset>0x7C24</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x40</resetValue>
                    <resetMask>0xF0</resetMask>
                    <fields>
                        <field>
                            <name>USBCKS</name>
                            <description>desc USBCKS</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CKSWR</name>
                    <description>desc CKSWR</description>
                    <addressOffset>0x7C26</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>CKSW</name>
                            <description>desc CKSW</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLLHCR</name>
                    <description>desc PLLHCR</description>
                    <addressOffset>0x7C2A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>PLLHOFF</name>
                            <description>desc PLLHOFF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLLACR</name>
                    <description>desc PLLACR</description>
                    <addressOffset>0x7C2E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>PLLAOFF</name>
                            <description>desc PLLAOFF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XTALCR</name>
                    <description>desc XTALCR</description>
                    <addressOffset>0x7C32</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>XTALSTP</name>
                            <description>desc XTALSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HRCCR</name>
                    <description>desc HRCCR</description>
                    <addressOffset>0x7C36</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>HRCSTP</name>
                            <description>desc HRCSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MRCCR</name>
                    <description>desc MRCCR</description>
                    <addressOffset>0x7C38</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>MRCSTP</name>
                            <description>desc MRCSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OSCSTBSR</name>
                    <description>desc OSCSTBSR</description>
                    <addressOffset>0x7C3C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE9</resetMask>
                    <fields>
                        <field>
                            <name>HRCSTBF</name>
                            <description>desc HRCSTBF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALSTBF</name>
                            <description>desc XTALSTBF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLHSTBF</name>
                            <description>desc PLLHSTBF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLASTBF</name>
                            <description>desc PLLASTBF</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCO1CFGR</name>
                    <description>desc MCO1CFGR</description>
                    <addressOffset>0x7C3D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>MCOSEL</name>
                            <description>desc MCOSEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCODIV</name>
                            <description>desc MCODIV</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCOEN</name>
                            <description>desc MCOEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCO2CFGR</name>
                    <description>desc MCO2CFGR</description>
                    <addressOffset>0x7C3E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>MCOSEL</name>
                            <description>desc MCOSEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCODIV</name>
                            <description>desc MCODIV</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCOEN</name>
                            <description>desc MCOEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TPIUCKCFGR</name>
                    <description>desc TPIUCKCFGR</description>
                    <addressOffset>0x7C3F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x83</resetMask>
                    <fields>
                        <field>
                            <name>TPIUCKS</name>
                            <description>desc TPIUCKS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TPIUCKOE</name>
                            <description>desc TPIUCKOE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
