sophgo/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Source/GCC/svd/HC32F4A0.svd
                <register>
                    <name>MAC_MACSTSR</name>
                    <description>desc MAC_MACSTSR</description>
                    <addressOffset>0x10024</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x37F0377</resetMask>
                    <fields>
                        <field>
                            <name>MREA</name>
                            <description>desc MREA</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MRS</name>
                            <description>desc MRS</description>
                            <msb>2</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFWA</name>
                            <description>desc RFWA</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFRS</name>
                            <description>desc RFRS</description>
                            <msb>6</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFFL</name>
                            <description>desc RFFL</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MTEA</name>
                            <description>desc MTEA</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MTS</name>
                            <description>desc MTS</description>
                            <msb>18</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MTP</name>
                            <description>desc MTP</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TFRS</name>
                            <description>desc TFRS</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TFWA</name>
                            <description>desc TFWA</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TFNE</name>
                            <description>desc TFNE</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TFF</name>
                            <description>desc TFF</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_RTWKFFR</name>
                    <description>desc MAC_RTWKFFR</description>
                    <addressOffset>0x10028</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WKUPFRMFT</name>
                            <description>desc WKUPFRMFT</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_PMTCTLR</name>
                    <description>desc MAC_PMTCTLR</description>
                    <addressOffset>0x1002C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x87000667</resetMask>
                    <fields>
                        <field>
                            <name>PWDN</name>
                            <description>desc PWDN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPEN</name>
                            <description>desc MPEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKEN</name>
                            <description>desc WKEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPFR</name>
                            <description>desc MPFR</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WKFR</name>
                            <description>desc WKFR</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GLUB</name>
                            <description>desc GLUB</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTWKTR</name>
                            <description>desc RTWKTR</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTWKPT</name>
                            <description>desc RTWKPT</description>
                            <msb>26</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RTWKFR</name>
                            <description>desc RTWKFR</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_INTSTSR</name>
                    <description>desc MAC_INTSTSR</description>
                    <addressOffset>0x10038</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x278</resetMask>
                    <fields>
                        <field>
                            <name>PMTIS</name>
                            <description>desc PMTIS</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MMCIS</name>
                            <description>desc MMCIS</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MMCRXIS</name>
                            <description>desc MMCRXIS</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MMCTXIS</name>
                            <description>desc MMCTXIS</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TSPIS</name>
                            <description>desc TSPIS</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_INTMSKR</name>
                    <description>desc MAC_INTMSKR</description>
                    <addressOffset>0x1003C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x208</resetMask>
                    <fields>
                        <field>
                            <name>PMTIM</name>
                            <description>desc PMTIM</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPIM</name>
                            <description>desc TSPIM</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_MACADHR0</name>
                    <description>desc MAC_MACADHR0</description>
                    <addressOffset>0x10040</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x8000FFFF</resetValue>
                    <resetMask>0x8000FFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDRH0</name>
                            <description>desc ADDRH0</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AE0</name>
                            <description>desc AE0</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_MACADLR0</name>
                    <description>desc MAC_MACADLR0</description>
                    <addressOffset>0x10044</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDRL0</name>
                            <description>desc ADDRL0</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_MACADHR1</name>
                    <description>desc MAC_MACADHR1</description>
                    <addressOffset>0x10048</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0xFF00FFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDRH1</name>
                            <description>desc ADDRH1</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MBC1</name>
                            <description>desc MBC1</description>
                            <msb>29</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SA1</name>
                            <description>desc SA1</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AE1</name>
                            <description>desc AE1</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_MACADLR1</name>
                    <description>desc MAC_MACADLR1</description>
                    <addressOffset>0x1004C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDRL1</name>
                            <description>desc ADDRL1</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_MACADHR2</name>
                    <description>desc MAC_MACADHR2</description>
                    <addressOffset>0x10050</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0xFF00FFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDRH2</name>
                            <description>desc ADDRH2</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MBC2</name>
                            <description>desc MBC2</description>
                            <msb>29</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SA2</name>
                            <description>desc SA2</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AE2</name>
                            <description>desc AE2</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_MACADLR2</name>
                    <description>desc MAC_MACADLR2</description>
                    <addressOffset>0x10054</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDRL2</name>
                            <description>desc ADDRL2</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_MACADHR3</name>
                    <description>desc MAC_MACADHR3</description>
                    <addressOffset>0x10058</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0xFF00FFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDRH3</name>
                            <description>desc ADDRH3</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MBC3</name>
                            <description>desc MBC3</description>
                            <msb>29</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SA3</name>
                            <description>desc SA3</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AE3</name>
                            <description>desc AE3</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_MACADLR3</name>
                    <description>desc MAC_MACADLR3</description>
                    <addressOffset>0x1005C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDRL3</name>
                            <description>desc ADDRL3</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_MACADHR4</name>
                    <description>desc MAC_MACADHR4</description>
                    <addressOffset>0x10060</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0xFF00FFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDRH4</name>
                            <description>desc ADDRH4</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MBC4</name>
                            <description>desc MBC4</description>
                            <msb>29</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SA4</name>
                            <description>desc SA4</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AE4</name>
                            <description>desc AE4</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_MACADLR4</name>
                    <description>desc MAC_MACADLR4</description>
                    <addressOffset>0x10064</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDRL4</name>
                            <description>desc ADDRL4</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
