sophgo/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Source/GCC/svd/HC32F4A0.svd
                <register>
                    <name>MMC_RXRUEFR</name>
                    <description>desc MMC_RXRUEFR</description>
                    <addressOffset>0x1019C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RXRUECNT</name>
                            <description>desc RXRUECNT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MMC_RXUNGFR</name>
                    <description>desc MMC_RXUNGFR</description>
                    <addressOffset>0x101C4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RXUNGCNT</name>
                            <description>desc RXUNGCNT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MMC_RXLEEFR</name>
                    <description>desc MMC_RXLEEFR</description>
                    <addressOffset>0x101C8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RXLEECNT</name>
                            <description>desc RXLEECNT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MMC_RXOREFR</name>
                    <description>desc MMC_RXOREFR</description>
                    <addressOffset>0x101CC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RXORECNT</name>
                            <description>desc RXORECNT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_L34CTLR</name>
                    <description>desc MAC_L34CTLR</description>
                    <addressOffset>0x10400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x13DFFFD</resetMask>
                    <fields>
                        <field>
                            <name>L3PEN</name>
                            <description>desc L3PEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L3SAM</name>
                            <description>desc L3SAM</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L3SAIM</name>
                            <description>desc L3SAIM</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L3DAM</name>
                            <description>desc L3DAM</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L3DAIM</name>
                            <description>desc L3DAIM</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L3HSBM</name>
                            <description>desc L3HSBM</description>
                            <msb>10</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L3HDBM</name>
                            <description>desc L3HDBM</description>
                            <msb>15</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L4PEN</name>
                            <description>desc L4PEN</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L4SPM</name>
                            <description>desc L4SPM</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L4SPIM</name>
                            <description>desc L4SPIM</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L4DPM</name>
                            <description>desc L4DPM</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L4DPIM</name>
                            <description>desc L4DPIM</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_L4PORTR</name>
                    <description>desc MAC_L4PORTR</description>
                    <addressOffset>0x10404</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>L4SPVAL</name>
                            <description>desc L4SPVAL</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L4DPVAL</name>
                            <description>desc L4DPVAL</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_L3ADDRR0</name>
                    <description>desc MAC_L3ADDRR0</description>
                    <addressOffset>0x10410</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>L3ADDR0</name>
                            <description>desc L3ADDR0</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_L3ADDRR1</name>
                    <description>desc MAC_L3ADDRR1</description>
                    <addressOffset>0x10414</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>L3ADDR2</name>
                            <description>desc L3ADDR2</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_L3ADDRR2</name>
                    <description>desc MAC_L3ADDRR2</description>
                    <addressOffset>0x10418</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>L3ADDR2</name>
                            <description>desc L3ADDR2</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_L3ADDRR3</name>
                    <description>desc MAC_L3ADDRR3</description>
                    <addressOffset>0x1041C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>L3ADDR3</name>
                            <description>desc L3ADDR3</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_VTACTLR</name>
                    <description>desc MAC_VTACTLR</description>
                    <addressOffset>0x10584</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x107FFFF</resetMask>
                    <fields>
                        <field>
                            <name>VLANV</name>
                            <description>desc VLANV</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VLANC</name>
                            <description>desc VLANC</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VLANS</name>
                            <description>desc VLANS</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_VLAHTBR</name>
                    <description>desc MAC_VLAHTBR</description>
                    <addressOffset>0x10588</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VLHT</name>
                            <description>desc VLHT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTP_TSPCTLR</name>
                    <description>desc PTP_TSPCTLR</description>
                    <addressOffset>0x10700</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2000</resetValue>
                    <resetMask>0x107FF3F</resetMask>
                    <fields>
                        <field>
                            <name>TSPEN</name>
                            <description>desc TSPEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPUPSEL</name>
                            <description>desc TSPUPSEL</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPINI</name>
                            <description>desc TSPINI</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPUP</name>
                            <description>desc TSPUP</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPINT</name>
                            <description>desc TSPINT</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPADUP</name>
                            <description>desc TSPADUP</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPEALL</name>
                            <description>desc TSPEALL</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPSSR</name>
                            <description>desc TSPSSR</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPVER</name>
                            <description>desc TSPVER</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPOVETH</name>
                            <description>desc TSPOVETH</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPOVIPV6</name>
                            <description>desc TSPOVIPV6</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPOVIPV4</name>
                            <description>desc TSPOVIPV4</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPMTSEL</name>
                            <description>desc TSPMTSEL</description>
                            <msb>17</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPADF</name>
                            <description>desc TSPADF</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTP_TSPNSAR</name>
                    <description>desc PTP_TSPNSAR</description>
                    <addressOffset>0x10704</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TSPNSEADD</name>
                            <description>desc TSPNSEADD</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTP_TMSSECR</name>
                    <description>desc PTP_TMSSECR</description>
                    <addressOffset>0x10708</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TSPSYSSEC</name>
                            <description>desc TSPSYSSEC</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTP_TMSNSER</name>
                    <description>desc PTP_TMSNSER</description>
                    <addressOffset>0x1070C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TSPSYSNSEC</name>
                            <description>desc TSPSYSNSEC</description>
                            <msb>30</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTP_TMUSECR</name>
                    <description>desc PTP_TMUSECR</description>
                    <addressOffset>0x10710</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TSPUPSEC</name>
                            <description>desc TSPUPSEC</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTP_TMUNSER</name>
                    <description>desc PTP_TMUNSER</description>
                    <addressOffset>0x10714</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TSPUPNSEC</name>
                            <description>desc TSPUPNSEC</description>
                            <msb>30</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSPUPNS</name>
                            <description>desc TSPUPNS</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTP_TSPADDR</name>
                    <description>desc PTP_TSPADDR</description>
                    <addressOffset>0x10718</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TSPADD</name>
                            <description>desc TSPADD</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
