sophgo/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Source/GCC/svd/HC32F4A0.svd
                <register>
                    <name>DMA_OPRMODR</name>
                    <description>desc DMA_OPRMODR</description>
                    <addressOffset>0x11018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x731E0FE</resetMask>
                    <fields>
                        <field>
                            <name>STR</name>
                            <description>desc STR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSF</name>
                            <description>desc OSF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTC</name>
                            <description>desc RTC</description>
                            <msb>4</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DGF</name>
                            <description>desc DGF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FUF</name>
                            <description>desc FUF</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FEF</name>
                            <description>desc FEF</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STT</name>
                            <description>desc STT</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TTC</name>
                            <description>desc TTC</description>
                            <msb>16</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FTF</name>
                            <description>desc FTF</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSF</name>
                            <description>desc TSF</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DFRF</name>
                            <description>desc DFRF</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSF</name>
                            <description>desc RSF</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTCOE</name>
                            <description>desc DTCOE</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_INTENAR</name>
                    <description>desc DMA_INTENAR</description>
                    <addressOffset>0x1101C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x101E7FF</resetMask>
                    <fields>
                        <field>
                            <name>TIE</name>
                            <description>desc TIE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSE</name>
                            <description>desc TSE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TUE</name>
                            <description>desc TUE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TJE</name>
                            <description>desc TJE</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVE</name>
                            <description>desc OVE</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UNE</name>
                            <description>desc UNE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RIE</name>
                            <description>desc RIE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RUE</name>
                            <description>desc RUE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSE</name>
                            <description>desc RSE</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RWE</name>
                            <description>desc RWE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ETE</name>
                            <description>desc ETE</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FBE</name>
                            <description>desc FBE</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERE</name>
                            <description>desc ERE</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AIE</name>
                            <description>desc AIE</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NIE</name>
                            <description>desc NIE</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_RFRCNTR</name>
                    <description>desc DMA_RFRCNTR</description>
                    <addressOffset>0x11020</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>UNACNT</name>
                            <description>desc UNACNT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>UNAOVF</name>
                            <description>desc UNAOVF</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OVFCNT</name>
                            <description>desc OVFCNT</description>
                            <msb>27</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OVFOVF</name>
                            <description>desc OVFOVF</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_REVWDTR</name>
                    <description>desc DMA_REVWDTR</description>
                    <addressOffset>0x11024</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>RIWT</name>
                            <description>desc RIWT</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_CHTXDER</name>
                    <description>desc DMA_CHTXDER</description>
                    <addressOffset>0x11048</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CHTXDE</name>
                            <description>desc CHTXDE</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_CHRXDER</name>
                    <description>desc DMA_CHRXDER</description>
                    <addressOffset>0x1104C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CHRXDE</name>
                            <description>desc CHRXDE</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_CHTXBFR</name>
                    <description>desc DMA_CHTXBFR</description>
                    <addressOffset>0x11050</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CHTXBF</name>
                            <description>desc CHTXBF</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_CHRXBFR</name>
                    <description>desc DMA_CHRXBFR</description>
                    <addressOffset>0x11054</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CHRXBF</name>
                            <description>desc CHRXBF</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
