sophgo/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Source/GCC/svd/HC32F4A0.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="I2S1">
            <name>I2S2</name>
            <description>desc I2S</description>
            <baseAddress>0x4001E400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="I2S1">
            <name>I2S3</name>
            <description>desc I2S</description>
            <baseAddress>0x40022000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="I2S1">
            <name>I2S4</name>
            <description>desc I2S</description>
            <baseAddress>0x40022400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>ICG</name>
            <description>desc ICG</description>
            <baseAddress>0x00000400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x10</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>ICG0</name>
                    <description>desc ICG0</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>SWDTAUTS</name>
                            <description>desc SWDTAUTS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTITS</name>
                            <description>desc SWDTITS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTPERI</name>
                            <description>desc SWDTPERI</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTCKS</name>
                            <description>desc SWDTCKS</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTWDPT</name>
                            <description>desc SWDTWDPT</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTSLPOFF</name>
                            <description>desc SWDTSLPOFF</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WDTAUTS</name>
                            <description>desc WDTAUTS</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WDTITS</name>
                            <description>desc WDTITS</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WDTPERI</name>
                            <description>desc WDTPERI</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WDTCKS</name>
                            <description>desc WDTCKS</description>
                            <msb>23</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WDTWDPT</name>
                            <description>desc WDTWDPT</description>
                            <msb>27</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WDTSLPOFF</name>
                            <description>desc WDTSLPOFF</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICG1</name>
                    <description>desc ICG1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0x70101</resetMask>
                    <fields>
                        <field>
                            <name>HRCFREQSEL</name>
                            <description>desc HRCFREQSEL</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HRCSTOP</name>
                            <description>desc HRCSTOP</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BOR_LEV</name>
                            <description>desc BOR_LEV</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BORDIS</name>
                            <description>desc BORDIS</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICG3</name>
                    <description>desc ICG3</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DBUSPRT</name>
                            <description>desc DBUSPRT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
