sophgo/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Source/GCC/svd/HC32F4A0.svd
                <register>
                    <name>ECC_SYND6_2</name>
                    <description>desc ECC_SYND6_2</description>
                    <addressOffset>0x80E8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S5</name>
                            <description>desc S5</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S6</name>
                            <description>desc S6</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND6_3</name>
                    <description>desc ECC_SYND6_3</description>
                    <addressOffset>0x80EC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S7</name>
                            <description>desc S7</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S8</name>
                            <description>desc S8</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND7_0</name>
                    <description>desc ECC_SYND7_0</description>
                    <addressOffset>0x80F0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S1</name>
                            <description>desc S1</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S2</name>
                            <description>desc S2</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND7_1</name>
                    <description>desc ECC_SYND7_1</description>
                    <addressOffset>0x80F4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S3</name>
                            <description>desc S3</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S4</name>
                            <description>desc S4</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND7_2</name>
                    <description>desc ECC_SYND7_2</description>
                    <addressOffset>0x80F8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S5</name>
                            <description>desc S5</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S6</name>
                            <description>desc S6</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND7_3</name>
                    <description>desc ECC_SYND7_3</description>
                    <addressOffset>0x80FC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S7</name>
                            <description>desc S7</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S8</name>
                            <description>desc S8</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND8_0</name>
                    <description>desc ECC_SYND8_0</description>
                    <addressOffset>0x8100</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S1</name>
                            <description>desc S1</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S2</name>
                            <description>desc S2</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND8_1</name>
                    <description>desc ECC_SYND8_1</description>
                    <addressOffset>0x8104</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S3</name>
                            <description>desc S3</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S4</name>
                            <description>desc S4</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND8_2</name>
                    <description>desc ECC_SYND8_2</description>
                    <addressOffset>0x8108</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S5</name>
                            <description>desc S5</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S6</name>
                            <description>desc S6</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND8_3</name>
                    <description>desc ECC_SYND8_3</description>
                    <addressOffset>0x810C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S7</name>
                            <description>desc S7</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S8</name>
                            <description>desc S8</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND9_0</name>
                    <description>desc ECC_SYND9_0</description>
                    <addressOffset>0x8110</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S1</name>
                            <description>desc S1</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S2</name>
                            <description>desc S2</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND9_1</name>
                    <description>desc ECC_SYND9_1</description>
                    <addressOffset>0x8114</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S3</name>
                            <description>desc S3</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S4</name>
                            <description>desc S4</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND9_2</name>
                    <description>desc ECC_SYND9_2</description>
                    <addressOffset>0x8118</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S5</name>
                            <description>desc S5</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S6</name>
                            <description>desc S6</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND9_3</name>
                    <description>desc ECC_SYND9_3</description>
                    <addressOffset>0x811C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S7</name>
                            <description>desc S7</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S8</name>
                            <description>desc S8</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND10_0</name>
                    <description>desc ECC_SYND10_0</description>
                    <addressOffset>0x8120</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S1</name>
                            <description>desc S1</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S2</name>
                            <description>desc S2</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND10_1</name>
                    <description>desc ECC_SYND10_1</description>
                    <addressOffset>0x8124</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S3</name>
                            <description>desc S3</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S4</name>
                            <description>desc S4</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND10_2</name>
                    <description>desc ECC_SYND10_2</description>
                    <addressOffset>0x8128</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S5</name>
                            <description>desc S5</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S6</name>
                            <description>desc S6</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND10_3</name>
                    <description>desc ECC_SYND10_3</description>
                    <addressOffset>0x812C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S7</name>
                            <description>desc S7</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S8</name>
                            <description>desc S8</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND11_0</name>
                    <description>desc ECC_SYND11_0</description>
                    <addressOffset>0x8130</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S1</name>
                            <description>desc S1</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S2</name>
                            <description>desc S2</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND11_1</name>
                    <description>desc ECC_SYND11_1</description>
                    <addressOffset>0x8134</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S3</name>
                            <description>desc S3</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S4</name>
                            <description>desc S4</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND11_2</name>
                    <description>desc ECC_SYND11_2</description>
                    <addressOffset>0x8138</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S5</name>
                            <description>desc S5</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S6</name>
                            <description>desc S6</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC_SYND11_3</name>
                    <description>desc ECC_SYND11_3</description>
                    <addressOffset>0x813C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFF1FFF</resetMask>
                    <fields>
                        <field>
                            <name>S7</name>
                            <description>desc S7</description>
                            <msb>12</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>S8</name>
                            <description>desc S8</description>
                            <msb>28</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
