sophgo/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Source/GCC/svd/HC32F4A0.svd
                <register>
                    <name>HCINT8</name>
                    <description>desc HCINT8</description>
                    <addressOffset>0x608</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FF</resetMask>
                    <fields>
                        <field>
                            <name>XFRC</name>
                            <description>desc XFRC</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHH</name>
                            <description>desc CHH</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHBERR</name>
                            <description>desc AHBERR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>desc STALL</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>desc NAK</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>desc ACK</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>desc NYET</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXERR</name>
                            <description>desc TXERR</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BBERR</name>
                            <description>desc BBERR</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRMOR</name>
                            <description>desc FRMOR</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTERR</name>
                            <description>desc DTERR</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCINTMSK8</name>
                    <description>desc HCINTMSK8</description>
                    <addressOffset>0x60C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FF</resetMask>
                    <fields>
                        <field>
                            <name>XFRCM</name>
                            <description>desc XFRCM</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHHM</name>
                            <description>desc CHHM</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHBERRM</name>
                            <description>desc AHBERRM</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STALLM</name>
                            <description>desc STALLM</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAKM</name>
                            <description>desc NAKM</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ACKM</name>
                            <description>desc ACKM</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NYETM</name>
                            <description>desc NYETM</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXERRM</name>
                            <description>desc TXERRM</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BBERRM</name>
                            <description>desc BBERRM</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRMORM</name>
                            <description>desc FRMORM</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTERRM</name>
                            <description>desc DTERRM</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCTSIZ8</name>
                    <description>desc HCTSIZ8</description>
                    <addressOffset>0x610</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>XFRSIZ</name>
                            <description>desc XFRSIZ</description>
                            <msb>18</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PKTCNT</name>
                            <description>desc PKTCNT</description>
                            <msb>28</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>desc DPID</description>
                            <msb>30</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DOPING</name>
                            <description>desc DOPING</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCDMA8</name>
                    <description>desc HCDMA8</description>
                    <addressOffset>0x614</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>HCCHAR9</name>
                    <description>desc HCCHAR9</description>
                    <addressOffset>0x620</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFEFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MPSIZ</name>
                            <description>desc MPSIZ</description>
                            <msb>10</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPNUM</name>
                            <description>desc EPNUM</description>
                            <msb>14</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDIR</name>
                            <description>desc EPDIR</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LSDEV</name>
                            <description>desc LSDEV</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPTYP</name>
                            <description>desc EPTYP</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MC</name>
                            <description>desc MC</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DAD</name>
                            <description>desc DAD</description>
                            <msb>28</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ODDFRM</name>
                            <description>desc ODDFRM</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHDIS</name>
                            <description>desc CHDIS</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHENA</name>
                            <description>desc CHENA</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCSPLT9</name>
                    <description>desc HCSPLT9</description>
                    <addressOffset>0x624</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x8001FFFF</resetMask>
                    <fields>
                        <field>
                            <name>PRTADDR</name>
                            <description>desc PRTADDR</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HUBADDR</name>
                            <description>desc HUBADDR</description>
                            <msb>13</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XACTPOS</name>
                            <description>desc XACTPOS</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMPLSPLT</name>
                            <description>desc COMPLSPLT</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPLITEN</name>
                            <description>desc SPLITEN</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCINT9</name>
                    <description>desc HCINT9</description>
                    <addressOffset>0x628</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FF</resetMask>
                    <fields>
                        <field>
                            <name>XFRC</name>
                            <description>desc XFRC</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHH</name>
                            <description>desc CHH</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHBERR</name>
                            <description>desc AHBERR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>desc STALL</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>desc NAK</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>desc ACK</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>desc NYET</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXERR</name>
                            <description>desc TXERR</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BBERR</name>
                            <description>desc BBERR</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRMOR</name>
                            <description>desc FRMOR</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTERR</name>
                            <description>desc DTERR</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCINTMSK9</name>
                    <description>desc HCINTMSK9</description>
                    <addressOffset>0x62C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FF</resetMask>
                    <fields>
                        <field>
                            <name>XFRCM</name>
                            <description>desc XFRCM</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHHM</name>
                            <description>desc CHHM</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHBERRM</name>
                            <description>desc AHBERRM</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STALLM</name>
                            <description>desc STALLM</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAKM</name>
                            <description>desc NAKM</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ACKM</name>
                            <description>desc ACKM</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NYETM</name>
                            <description>desc NYETM</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXERRM</name>
                            <description>desc TXERRM</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BBERRM</name>
                            <description>desc BBERRM</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRMORM</name>
                            <description>desc FRMORM</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTERRM</name>
                            <description>desc DTERRM</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
